MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452KETB/mcu.h
/*******************************************************************************
                Bit definition for Peripheral OTS
*******************************************************************************/
/*  Bit definition for OTS_CTL register  */
#define OTS_CTL_OTSST_POS                              (0U)
#define OTS_CTL_OTSST                                  (0x0001U)
#define OTS_CTL_OTSCK_POS                              (1U)
#define OTS_CTL_OTSCK                                  (0x0002U)
#define OTS_CTL_OTSIE_POS                              (2U)
#define OTS_CTL_OTSIE                                  (0x0004U)
#define OTS_CTL_TSSTP_POS                              (3U)
#define OTS_CTL_TSSTP                                  (0x0008U)

/*  Bit definition for OTS_DR1 register  */
#define OTS_DR1                                        (0xFFFFU)

/*  Bit definition for OTS_DR2 register  */
#define OTS_DR2                                        (0xFFFFU)

/*  Bit definition for OTS_ECR register  */
#define OTS_ECR                                        (0xFFFFU)

/*******************************************************************************
                Bit definition for Peripheral PERIC
*******************************************************************************/
/*  Bit definition for PERIC_USBFS_SYCTLREG register  */
#define PERIC_USBFS_SYCTLREG_DFB_POS                   (0U)
#define PERIC_USBFS_SYCTLREG_DFB                       (0x00000001UL)
#define PERIC_USBFS_SYCTLREG_SOFEN_POS                 (1U)
#define PERIC_USBFS_SYCTLREG_SOFEN                     (0x00000002UL)

/*  Bit definition for PERIC_SDIOC_SYCTLREG register  */
#define PERIC_SDIOC_SYCTLREG_SELMMC1_POS               (1U)
#define PERIC_SDIOC_SYCTLREG_SELMMC1                   (0x00000002UL)
#define PERIC_SDIOC_SYCTLREG_SELMMC2_POS               (3U)
#define PERIC_SDIOC_SYCTLREG_SELMMC2                   (0x00000008UL)

/*******************************************************************************
                Bit definition for Peripheral PWC
*******************************************************************************/
/*  Bit definition for PWC_FCG0 register  */
#define PWC_FCG0_SRAMH_POS                             (0U)
#define PWC_FCG0_SRAMH                                 (0x00000001UL)
#define PWC_FCG0_SRAM12_POS                            (4U)
#define PWC_FCG0_SRAM12                                (0x00000010UL)
#define PWC_FCG0_SRAM3_POS                             (8U)
#define PWC_FCG0_SRAM3                                 (0x00000100UL)
#define PWC_FCG0_SRAMRET_POS                           (10U)
#define PWC_FCG0_SRAMRET                               (0x00000400UL)
#define PWC_FCG0_DMA1_POS                              (14U)
#define PWC_FCG0_DMA1                                  (0x00004000UL)
#define PWC_FCG0_DMA2_POS                              (15U)
#define PWC_FCG0_DMA2                                  (0x00008000UL)
#define PWC_FCG0_FCM_POS                               (16U)
#define PWC_FCG0_FCM                                   (0x00010000UL)
#define PWC_FCG0_AOS_POS                               (17U)
#define PWC_FCG0_AOS                                   (0x00020000UL)
#define PWC_FCG0_AES_POS                               (20U)
#define PWC_FCG0_AES                                   (0x00100000UL)
#define PWC_FCG0_HASH_POS                              (21U)
#define PWC_FCG0_HASH                                  (0x00200000UL)
#define PWC_FCG0_TRNG_POS                              (22U)
#define PWC_FCG0_TRNG                                  (0x00400000UL)
#define PWC_FCG0_CRC_POS                               (23U)
#define PWC_FCG0_CRC                                   (0x00800000UL)
#define PWC_FCG0_DCU1_POS                              (24U)
#define PWC_FCG0_DCU1                                  (0x01000000UL)
#define PWC_FCG0_DCU2_POS                              (25U)
#define PWC_FCG0_DCU2                                  (0x02000000UL)
#define PWC_FCG0_DCU3_POS                              (26U)
#define PWC_FCG0_DCU3                                  (0x04000000UL)
#define PWC_FCG0_DCU4_POS                              (27U)
#define PWC_FCG0_DCU4                                  (0x08000000UL)
#define PWC_FCG0_KEY_POS                               (31U)
#define PWC_FCG0_KEY                                   (0x80000000UL)

/*  Bit definition for PWC_FCG1 register  */
#define PWC_FCG1_CAN_POS                               (0U)
#define PWC_FCG1_CAN                                   (0x00000001UL)
#define PWC_FCG1_QSPI_POS                              (3U)
#define PWC_FCG1_QSPI                                  (0x00000008UL)
#define PWC_FCG1_I2C1_POS                              (4U)
#define PWC_FCG1_I2C1                                  (0x00000010UL)
#define PWC_FCG1_I2C2_POS                              (5U)
#define PWC_FCG1_I2C2                                  (0x00000020UL)
#define PWC_FCG1_I2C3_POS                              (6U)
#define PWC_FCG1_I2C3                                  (0x00000040UL)
#define PWC_FCG1_USBFS_POS                             (8U)
#define PWC_FCG1_USBFS                                 (0x00000100UL)
#define PWC_FCG1_SDIOC1_POS                            (10U)
#define PWC_FCG1_SDIOC1                                (0x00000400UL)
#define PWC_FCG1_SDIOC2_POS                            (11U)
#define PWC_FCG1_SDIOC2                                (0x00000800UL)
#define PWC_FCG1_I2S1_POS                              (12U)
#define PWC_FCG1_I2S1                                  (0x00001000UL)
#define PWC_FCG1_I2S2_POS                              (13U)
#define PWC_FCG1_I2S2                                  (0x00002000UL)
#define PWC_FCG1_I2S3_POS                              (14U)
#define PWC_FCG1_I2S3                                  (0x00004000UL)
#define PWC_FCG1_I2S4_POS                              (15U)
#define PWC_FCG1_I2S4                                  (0x00008000UL)
#define PWC_FCG1_SPI1_POS                              (16U)
#define PWC_FCG1_SPI1                                  (0x00010000UL)
#define PWC_FCG1_SPI2_POS                              (17U)
#define PWC_FCG1_SPI2                                  (0x00020000UL)
#define PWC_FCG1_SPI3_POS                              (18U)
#define PWC_FCG1_SPI3                                  (0x00040000UL)
#define PWC_FCG1_SPI4_POS                              (19U)
#define PWC_FCG1_SPI4                                  (0x00080000UL)
#define PWC_FCG1_USART1_POS                            (24U)
#define PWC_FCG1_USART1                                (0x01000000UL)
#define PWC_FCG1_USART2_POS                            (25U)
#define PWC_FCG1_USART2                                (0x02000000UL)
#define PWC_FCG1_USART3_POS                            (26U)
#define PWC_FCG1_USART3                                (0x04000000UL)
#define PWC_FCG1_USART4_POS                            (27U)
#define PWC_FCG1_USART4                                (0x08000000UL)

/*  Bit definition for PWC_FCG2 register  */
#define PWC_FCG2_TIMER0_1_POS                          (0U)
#define PWC_FCG2_TIMER0_1                              (0x00000001UL)
#define PWC_FCG2_TIMER0_2_POS                          (1U)
#define PWC_FCG2_TIMER0_2                              (0x00000002UL)
#define PWC_FCG2_TIMERA_1_POS                          (2U)
#define PWC_FCG2_TIMERA_1                              (0x00000004UL)
#define PWC_FCG2_TIMERA_2_POS                          (3U)
#define PWC_FCG2_TIMERA_2                              (0x00000008UL)
#define PWC_FCG2_TIMERA_3_POS                          (4U)
#define PWC_FCG2_TIMERA_3                              (0x00000010UL)
#define PWC_FCG2_TIMERA_4_POS                          (5U)
#define PWC_FCG2_TIMERA_4                              (0x00000020UL)
#define PWC_FCG2_TIMERA_5_POS                          (6U)
#define PWC_FCG2_TIMERA_5                              (0x00000040UL)
#define PWC_FCG2_TIMERA_6_POS                          (7U)
#define PWC_FCG2_TIMERA_6                              (0x00000080UL)
#define PWC_FCG2_TIMER4_1_POS                          (8U)
#define PWC_FCG2_TIMER4_1                              (0x00000100UL)
#define PWC_FCG2_TIMER4_2_POS                          (9U)
#define PWC_FCG2_TIMER4_2                              (0x00000200UL)
#define PWC_FCG2_TIMER4_3_POS                          (10U)
#define PWC_FCG2_TIMER4_3                              (0x00000400UL)
#define PWC_FCG2_EMB_POS                               (15U)
#define PWC_FCG2_EMB                                   (0x00008000UL)
#define PWC_FCG2_TIMER6_1_POS                          (16U)
#define PWC_FCG2_TIMER6_1                              (0x00010000UL)
#define PWC_FCG2_TIMER6_2_POS                          (17U)
#define PWC_FCG2_TIMER6_2                              (0x00020000UL)
#define PWC_FCG2_TIMER6_3_POS                          (18U)
#define PWC_FCG2_TIMER6_3                              (0x00040000UL)

