MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452KETB/mcu.h
/*  Bit definition for TMR4_SCMR register  */
#define TMR4_SCMR_AMC_POS                              (0U)
#define TMR4_SCMR_AMC                                  (0x000FU)
#define TMR4_SCMR_MZCE_POS                             (6U)
#define TMR4_SCMR_MZCE                                 (0x0040U)
#define TMR4_SCMR_MPCE_POS                             (7U)
#define TMR4_SCMR_MPCE                                 (0x0080U)

/*  Bit definition for TMR4_ECSR register  */
#define TMR4_ECSR_HOLD_POS                             (7U)
#define TMR4_ECSR_HOLD                                 (0x0080U)

/*******************************************************************************
                Bit definition for Peripheral TMR4CR
*******************************************************************************/
/*  Bit definition for TMR4CR_ECER1 register  */
#define TMR4CR_ECER1_EMBVAL                            (0x00000003UL)
#define TMR4CR_ECER1_EMBVAL_0                          (0x00000001UL)
#define TMR4CR_ECER1_EMBVAL_1                          (0x00000002UL)

/*  Bit definition for TMR4CR_ECER2 register  */
#define TMR4CR_ECER2_EMBVAL                            (0x00000003UL)
#define TMR4CR_ECER2_EMBVAL_0                          (0x00000001UL)
#define TMR4CR_ECER2_EMBVAL_1                          (0x00000002UL)

/*  Bit definition for TMR4CR_ECER3 register  */
#define TMR4CR_ECER3_EMBVAL                            (0x00000003UL)
#define TMR4CR_ECER3_EMBVAL_0                          (0x00000001UL)
#define TMR4CR_ECER3_EMBVAL_1                          (0x00000002UL)

/*******************************************************************************
                Bit definition for Peripheral TMR6
*******************************************************************************/
/*  Bit definition for TMR6_CNTER register  */
#define TMR6_CNTER_CNT                                 (0x0000FFFFUL)

/*  Bit definition for TMR6_PERAR register  */
#define TMR6_PERAR_PERA                                (0x0000FFFFUL)

/*  Bit definition for TMR6_PERBR register  */
#define TMR6_PERBR_PERB                                (0x0000FFFFUL)

/*  Bit definition for TMR6_PERCR register  */
#define TMR6_PERCR_PERC                                (0x0000FFFFUL)

/*  Bit definition for TMR6_GCMAR register  */
#define TMR6_GCMAR_GCMA                                (0x0000FFFFUL)

/*  Bit definition for TMR6_GCMBR register  */
#define TMR6_GCMBR_GCMB                                (0x0000FFFFUL)

/*  Bit definition for TMR6_GCMCR register  */
#define TMR6_GCMCR_GCMC                                (0x0000FFFFUL)

/*  Bit definition for TMR6_GCMDR register  */
#define TMR6_GCMDR_GCMD                                (0x0000FFFFUL)

/*  Bit definition for TMR6_GCMER register  */
#define TMR6_GCMER_GCME                                (0x0000FFFFUL)

/*  Bit definition for TMR6_GCMFR register  */
#define TMR6_GCMFR_GCMF                                (0x0000FFFFUL)

/*  Bit definition for TMR6_SCMAR register  */
#define TMR6_SCMAR_SCMA                                (0x0000FFFFUL)

/*  Bit definition for TMR6_SCMBR register  */
#define TMR6_SCMBR_SCMB                                (0x0000FFFFUL)

/*  Bit definition for TMR6_SCMCR register  */
#define TMR6_SCMCR_SCMC                                (0x0000FFFFUL)

/*  Bit definition for TMR6_SCMDR register  */
#define TMR6_SCMDR_SCMD                                (0x0000FFFFUL)

/*  Bit definition for TMR6_SCMER register  */
#define TMR6_SCMER_SCME                                (0x0000FFFFUL)

/*  Bit definition for TMR6_SCMFR register  */
#define TMR6_SCMFR_SCMF                                (0x0000FFFFUL)

/*  Bit definition for TMR6_DTUAR register  */
#define TMR6_DTUAR_DTUA                                (0x0000FFFFUL)

/*  Bit definition for TMR6_DTDAR register  */
#define TMR6_DTDAR_DTDA                                (0x0000FFFFUL)

/*  Bit definition for TMR6_DTUBR register  */
#define TMR6_DTUBR_DTUB                                (0x0000FFFFUL)

/*  Bit definition for TMR6_DTDBR register  */
#define TMR6_DTDBR_DTDB                                (0x0000FFFFUL)

/*  Bit definition for TMR6_GCONR register  */
#define TMR6_GCONR_START_POS                           (0U)
#define TMR6_GCONR_START                               (0x00000001UL)
#define TMR6_GCONR_MODE_POS                            (1U)
#define TMR6_GCONR_MODE                                (0x0000000EUL)
#define TMR6_GCONR_CKDIV_POS                           (4U)
#define TMR6_GCONR_CKDIV                               (0x00000070UL)
#define TMR6_GCONR_DIR_POS                             (8U)
#define TMR6_GCONR_DIR                                 (0x00000100UL)
#define TMR6_GCONR_ZMSKREV_POS                         (16U)
#define TMR6_GCONR_ZMSKREV                             (0x00010000UL)
#define TMR6_GCONR_ZMSKPOS_POS                         (17U)
#define TMR6_GCONR_ZMSKPOS                             (0x00020000UL)
#define TMR6_GCONR_ZMSKVAL_POS                         (18U)
#define TMR6_GCONR_ZMSKVAL                             (0x000C0000UL)
#define TMR6_GCONR_ZMSKVAL_0                           (0x00040000UL)
#define TMR6_GCONR_ZMSKVAL_1                           (0x00080000UL)

/*  Bit definition for TMR6_ICONR register  */
#define TMR6_ICONR_INTENA_POS                          (0U)
#define TMR6_ICONR_INTENA                              (0x00000001UL)
#define TMR6_ICONR_INTENB_POS                          (1U)
#define TMR6_ICONR_INTENB                              (0x00000002UL)
#define TMR6_ICONR_INTENC_POS                          (2U)
#define TMR6_ICONR_INTENC                              (0x00000004UL)
#define TMR6_ICONR_INTEND_POS                          (3U)
#define TMR6_ICONR_INTEND                              (0x00000008UL)
#define TMR6_ICONR_INTENE_POS                          (4U)
#define TMR6_ICONR_INTENE                              (0x00000010UL)
#define TMR6_ICONR_INTENF_POS                          (5U)
#define TMR6_ICONR_INTENF                              (0x00000020UL)
#define TMR6_ICONR_INTENOVF_POS                        (6U)
#define TMR6_ICONR_INTENOVF                            (0x00000040UL)
#define TMR6_ICONR_INTENUDF_POS                        (7U)
#define TMR6_ICONR_INTENUDF                            (0x00000080UL)
#define TMR6_ICONR_INTENDTE_POS                        (8U)
#define TMR6_ICONR_INTENDTE                            (0x00000100UL)
#define TMR6_ICONR_INTENSAU_POS                        (16U)
#define TMR6_ICONR_INTENSAU                            (0x00010000UL)
#define TMR6_ICONR_INTENSAD_POS                        (17U)
#define TMR6_ICONR_INTENSAD                            (0x00020000UL)
#define TMR6_ICONR_INTENSBU_POS                        (18U)
#define TMR6_ICONR_INTENSBU                            (0x00040000UL)
#define TMR6_ICONR_INTENSBD_POS                        (19U)
#define TMR6_ICONR_INTENSBD                            (0x00080000UL)

/*  Bit definition for TMR6_PCONR register  */
#define TMR6_PCONR_CAPMDA_POS                          (0U)
#define TMR6_PCONR_CAPMDA                              (0x00000001UL)
#define TMR6_PCONR_STACA_POS                           (1U)
#define TMR6_PCONR_STACA                               (0x00000002UL)
#define TMR6_PCONR_STPCA_POS                           (2U)
#define TMR6_PCONR_STPCA                               (0x00000004UL)
#define TMR6_PCONR_STASTPSA_POS                        (3U)
#define TMR6_PCONR_STASTPSA                            (0x00000008UL)
#define TMR6_PCONR_CMPCA_POS                           (4U)
#define TMR6_PCONR_CMPCA                               (0x00000030UL)
#define TMR6_PCONR_CMPCA_0                             (0x00000010UL)
#define TMR6_PCONR_CMPCA_1                             (0x00000020UL)
#define TMR6_PCONR_PERCA_POS                           (6U)
#define TMR6_PCONR_PERCA                               (0x000000C0UL)
#define TMR6_PCONR_PERCA_0                             (0x00000040UL)
#define TMR6_PCONR_PERCA_1                             (0x00000080UL)
#define TMR6_PCONR_OUTENA_POS                          (8U)
#define TMR6_PCONR_OUTENA                              (0x00000100UL)
#define TMR6_PCONR_EMBVALA_POS                         (11U)
#define TMR6_PCONR_EMBVALA                             (0x00001800UL)
#define TMR6_PCONR_EMBVALA_0                           (0x00000800UL)
#define TMR6_PCONR_EMBVALA_1                           (0x00001000UL)
#define TMR6_PCONR_CAPMDB_POS                          (16U)
#define TMR6_PCONR_CAPMDB                              (0x00010000UL)
#define TMR6_PCONR_STACB_POS                           (17U)
#define TMR6_PCONR_STACB                               (0x00020000UL)
#define TMR6_PCONR_STPCB_POS                           (18U)
#define TMR6_PCONR_STPCB                               (0x00040000UL)
#define TMR6_PCONR_STASTPSB_POS                        (19U)
#define TMR6_PCONR_STASTPSB                            (0x00080000UL)
#define TMR6_PCONR_CMPCB_POS                           (20U)
#define TMR6_PCONR_CMPCB                               (0x00300000UL)
#define TMR6_PCONR_CMPCB_0                             (0x00100000UL)
#define TMR6_PCONR_CMPCB_1                             (0x00200000UL)
#define TMR6_PCONR_PERCB_POS                           (22U)
#define TMR6_PCONR_PERCB                               (0x00C00000UL)
#define TMR6_PCONR_PERCB_0                             (0x00400000UL)
#define TMR6_PCONR_PERCB_1                             (0x00800000UL)
#define TMR6_PCONR_OUTENB_POS                          (24U)
#define TMR6_PCONR_OUTENB                              (0x01000000UL)
#define TMR6_PCONR_EMBVALB_POS                         (27U)
#define TMR6_PCONR_EMBVALB                             (0x18000000UL)
#define TMR6_PCONR_EMBVALB_0                           (0x08000000UL)
#define TMR6_PCONR_EMBVALB_1                           (0x10000000UL)

