MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452KETB/mcu.h
typedef struct {
    __IO uint32_t TSA;
    __IO uint32_t TSALL;
    __IO uint32_t TSONE;
    __IO uint32_t TPA;
    __IO uint32_t TPE;
    uint32_t RESERVED0[1];
    __IO uint32_t LOM;
    __IO uint32_t TBSEL;
} stc_can_tcmd_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t TTTBM;
    __IO uint32_t TSMODE;
    __IO uint32_t TSNEXT;
    uint32_t RESERVED1[1];
} stc_can_tctrl_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t RBALL;
    __IO uint32_t RREL;
    __I  uint32_t ROV;
    __IO uint32_t ROM;
    __IO uint32_t SACK;
} stc_can_rctrl_bit_t;

typedef struct {
    __I  uint32_t TSFF;
    __IO uint32_t EIE;
    __IO uint32_t TSIE;
    __IO uint32_t TPIE;
    __IO uint32_t RAFIE;
    __IO uint32_t RFIE;
    __IO uint32_t ROIE;
    __IO uint32_t RIE;
} stc_can_rtie_bit_t;

typedef struct {
    __IO uint32_t AIF;
    __IO uint32_t EIF;
    __IO uint32_t TSIF;
    __IO uint32_t TPIF;
    __IO uint32_t RAFIF;
    __IO uint32_t RFIF;
    __IO uint32_t ROIF;
    __IO uint32_t RIF;
} stc_can_rtif_bit_t;

typedef struct {
    __IO uint32_t BEIF;
    __IO uint32_t BEIE;
    __IO uint32_t ALIF;
    __IO uint32_t ALIE;
    __IO uint32_t EPIF;
    __IO uint32_t EPIE;
    __I  uint32_t EPASS;
    __I  uint32_t EWARN;
} stc_can_errint_bit_t;

typedef struct {
    uint32_t RESERVED0[5];
    __IO uint32_t SELMASK;
    uint32_t RESERVED1[2];
} stc_can_acfctrl_bit_t;

typedef struct {
    __IO uint32_t AE_1;
    __IO uint32_t AE_2;
    __IO uint32_t AE_3;
    __IO uint32_t AE_4;
    __IO uint32_t AE_5;
    __IO uint32_t AE_6;
    __IO uint32_t AE_7;
    __IO uint32_t AE_8;
} stc_can_acfen_bit_t;

typedef struct {
    uint32_t RESERVED0[29];
    __IO uint32_t AIDE;
    __IO uint32_t AIDEE;
    uint32_t RESERVED1[1];
} stc_can_acf_bit_t;

typedef struct {
    uint32_t RESERVED0[6];
    __IO uint32_t TBF;
    __IO uint32_t TBE;
} stc_can_tbslot_bit_t;

typedef struct {
    __IO uint32_t TTEN;
    uint32_t RESERVED0[2];
    __IO uint32_t TTIF;
    __IO uint32_t TTIE;
    __IO uint32_t TEIF;
    __IO uint32_t WTIF;
    __IO uint32_t WTIE;
} stc_can_ttcfg_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __IO uint32_t REF_IDE;
} stc_can_ref_msg_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t IEN;
    __IO uint32_t CVSEN;
    uint32_t RESERVED1[3];
    __IO uint32_t OUTEN;
    __IO uint32_t INV;
    __IO uint32_t CMPOE;
    __IO uint32_t CMPON;
} stc_cmp_ctrl_bit_t;

typedef struct {
    __IO uint32_t RVSL0;
    __IO uint32_t RVSL1;
    __IO uint32_t RVSL2;
    __IO uint32_t RVSL3;
    uint32_t RESERVED0[4];
    __IO uint32_t CVSL0;
    __IO uint32_t CVSL1;
    __IO uint32_t CVSL2;
    __IO uint32_t CVSL3;
    __IO uint32_t C4SL0;
    __IO uint32_t C4SL1;
    __IO uint32_t C4SL2;
    uint32_t RESERVED1[1];
} stc_cmp_vltsel_bit_t;

typedef struct {
    __I  uint32_t OMON;
    uint32_t RESERVED0[15];
} stc_cmp_outmon_bit_t;

typedef struct {
    __IO uint32_t DA1EN;
    __IO uint32_t DA2EN;
    uint32_t RESERVED0[14];
} stc_cmpcr_dacr_bit_t;

typedef struct {
    __IO uint32_t DA1SW;
    __IO uint32_t DA2SW;
    uint32_t RESERVED0[2];
    __IO uint32_t VREFSW;
    uint32_t RESERVED1[11];
} stc_cmpcr_rvadc_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t CR;
    __IO uint32_t REFIN;
    __IO uint32_t REFOUT;
    __IO uint32_t XOROUT;
    uint32_t RESERVED1[27];
} stc_crc_cr_bit_t;

typedef struct {
    uint32_t RESERVED0[16];
    __I  uint32_t CRCFLAG_16;
    uint32_t RESERVED1[15];
} stc_crc_reslt_bit_t;

typedef struct {
    __I  uint32_t CRCFLAG_32;
    uint32_t RESERVED0[31];
} stc_crc_flg_bit_t;

typedef struct {
    __IO uint32_t AUTHFG;
    uint32_t RESERVED0[1];
    __IO uint32_t PRTLV1;
    __IO uint32_t PRTLV2;
    uint32_t RESERVED1[28];
} stc_dbgc_mcustat_bit_t;

typedef struct {
    __IO uint32_t ERASEREQ;
    __IO uint32_t ERASEACK;
    __IO uint32_t ERASEERR;
    uint32_t RESERVED0[29];
} stc_dbgc_fersctl_bit_t;

typedef struct {
    __IO uint32_t CDBGPWRUPREQ;
    __IO uint32_t CDBGPWRUPACK;
    uint32_t RESERVED0[30];
} stc_dbgc_mcudbgstat_bit_t;

typedef struct {
    __IO uint32_t SWDTSTP;
    __IO uint32_t WDTSTP;
    __IO uint32_t RTCSTP;
    uint32_t RESERVED0[11];
    __IO uint32_t TMR01STP;
    __IO uint32_t TMR02STP;
    uint32_t RESERVED1[4];
    __IO uint32_t TMR41STP;
    __IO uint32_t TMR42STP;
    __IO uint32_t TMR43STP;
    __IO uint32_t TM61STP;
    __IO uint32_t TM62STP;
    __IO uint32_t TMR63STP;
    __IO uint32_t TMRA1STP;
    __IO uint32_t TMRA2STP;
    __IO uint32_t TMRA3STP;
    __IO uint32_t TMRA4STP;
    __IO uint32_t TMRA5STP;
    __IO uint32_t TMRA6STP;
} stc_dbgc_mcustpctl_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t TRACEIOEN;
    uint32_t RESERVED1[29];
} stc_dbgc_mcutracectl_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t COMPTRG;
    uint32_t RESERVED1[22];
    __IO uint32_t INTEN;
} stc_dcu_ctl_bit_t;

typedef struct {
    __I  uint32_t FLAG_OP;
    __I  uint32_t FLAG_LS2;
    __I  uint32_t FLAG_EQ2;
    __I  uint32_t FLAG_GT2;
    __I  uint32_t FLAG_LS1;
    __I  uint32_t FLAG_EQ1;
    __I  uint32_t FLAG_GT1;
    uint32_t RESERVED0[25];
} stc_dcu_flag_bit_t;

typedef struct {
    __O  uint32_t CLR_OP;
    __O  uint32_t CLR_LS2;
    __O  uint32_t CLR_EQ2;
    __O  uint32_t CLR_GT2;
    __O  uint32_t CLR_LS1;
    __O  uint32_t CLR_EQ1;
    __O  uint32_t CLR_GT1;
    uint32_t RESERVED0[25];
} stc_dcu_flagclr_bit_t;

typedef struct {
    __IO uint32_t SEL_OP;
    __IO uint32_t SEL_LS2;
    __IO uint32_t SEL_EQ2;
    __IO uint32_t SEL_GT2;
    __IO uint32_t SEL_LS1;
    __IO uint32_t SEL_EQ1;
    __IO uint32_t SEL_GT1;
    uint32_t RESERVED0[25];
} stc_dcu_intevtsel_bit_t;

typedef struct {
    __IO uint32_t EN;
    uint32_t RESERVED0[31];
} stc_dma_en_bit_t;

typedef struct {
    __I  uint32_t TRNERR0;
    __I  uint32_t TRNERR1;
    __I  uint32_t TRNERR2;
    __I  uint32_t TRNERR3;
    uint32_t RESERVED0[12];
    __I  uint32_t REQERR0;
    __I  uint32_t REQERR1;
    __I  uint32_t REQERR2;
    __I  uint32_t REQERR3;
    uint32_t RESERVED1[12];
} stc_dma_intstat0_bit_t;

